### DataFrame 연산 - 3
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능해짐

In [18]:
# 1. 모듈 로딩
import pandas as pd
import numpy as np # 빈 칸을 의미하는 표현법 사용 위해서

In [19]:
# 2. 데이터 준비
data={'A':[98,78,np.nan,52], # np.nan >> flase(정수)취급
      'B':[97,75,10,50]}

In [20]:
# 3. Dict데이터를 >>> DataFrame 형태로 저장
DF1=pd.DataFrame(data)
DF1

      A   B
0  98.0  97
1  78.0  75
2   NaN  10
3  52.0  50

In [21]:
# 4. 연산 수행
# - DataFrame + 숫자  # 메서드 사용 : DF변수명.add(원하는 숫자)
# fill_value로 nan값에 숫자를 넣을 수 있다.
DF1.add(5,fill_value=10) , DF1+9

(       A    B
 0  103.0  102
 1   83.0   80
 2   15.0   15
 3   57.0   55,
        A    B
 0  107.0  106
 1   87.0   84
 2    NaN   19
 3   61.0   59)

In [22]:
# - DataFrame + DataFrame 그 칸에 맞추어서 더하기 진행 >>>>>>>>????axis???
DF1.add(DF1+10, axis=1), DF1.add(DF1, axis=1), DF1+DF1

(       A    B
 0  206.0  204
 1  166.0  160
 2    NaN   30
 3  114.0  110,
        A    B
 0  196.0  194
 1  156.0  150
 2    NaN   20
 3  104.0  100,
        A    B
 0  196.0  194
 1  156.0  150
 2    NaN   20
 3  104.0  100)

In [23]:
DF1.add(DF1, axis=1),DF1.add(DF1) #>>>>>>>>>>>>>>>axis=1 무슨의미가??

(       A    B
 0  196.0  194
 1  156.0  150
 2    NaN   20
 3  104.0  100,
        A    B
 0  196.0  194
 1  156.0  150
 2    NaN   20
 3  104.0  100)

In [24]:
data2={'A':[98,78,20,52],
      'B':[97,75,10,50]}
DF2 =pd.DataFrame(data2)
print(DF1, DF2, sep='\n')

      A   B
0  98.0  97
1  78.0  75
2   NaN  10
3  52.0  50
    A   B
0  98  97
1  78  75
2  20  10
3  52  50

In [25]:
DF1.add(DF2, fill_value=0)

       A    B
0  196.0  194
1  156.0  150
2   20.0   20
3  104.0  100

In [26]:
dd1=pd.DataFrame([[10,20,30,40], [40, 50, 60, 70]])

ss1=pd.Series([5,5])
print(dd1, ss1,sep='\n\n')

    0   1   2   3
0  10  20  30  40
1  40  50  60  70

0    5
1    5
dtype: int64

In [27]:
dd1+ss1 #>>>>???? 왜 뒤에 [2]까지 안가지?? 쭉 안가네?????

      0     1   2   3
0  15.0  25.0 NaN NaN
1  45.0  55.0 NaN NaN

In [28]:
dd1.T + ss1 # 인건 또 왜 새우니깐 돼냐 ㅋㅋㅋㅋㅋ 시리즈 인덱스가 column인가???

    0   1
0  15  45
1  25  55
2  35  65
3  45  75